"""コンストラクターデータ."""
constructor_ranking = [
    (1980, [
        (1, 'ウィリアムズ'), (2, 'リジェ'), (3, 'ブラバム'), (4, 'ルノー(1977)'),
        (5, 'ロータス(1958)'), (6, 'ティレル'), (7, 'アロウズ(1978)'),
        (8, 'フィッティパルディ'), (9, 'マクラーレン'), (10, 'フェラーリ'),
        (11, 'アルファロメオ(1979)'), (0, 'ATS'), (0, 'エンサイン'), (0, 'オゼッラ'),
        (0, 'シャドウ')
    ]),
    (1981, [
        (1, 'ウィリアムズ'), (2, 'ブラバム'), (3, 'ルノー(1977)'), (4, 'リジェ'),
        (5, 'フェラーリ'), (6, 'マクラーレン'), (7, 'ロータス(1958)'),
        (8, 'アロウズ(1978)'), (9, 'アルファロメオ(1979)'), (10, 'ティレル'),
        (11, 'エンサイン'), (12, 'セオドール'), (13, 'ATS'), (14, 'マーチ(1981)'),
        (0, 'フィッティパルディ'), (0, 'オゼッラ'), (0, 'トールマン')
    ]),
    (1982, [
        (1, 'フェラーリ'), (2, 'マクラーレン'), (3, 'ルノー(1977)'),
        (4, 'ウィリアムズ'), (5, 'ロータス(1958)'), (6, 'ティレル'), (7, 'ブラバム'),
        (8, 'リジェ'), (10, 'アルファロメオ(1979)'), (11, 'アロウズ(1978)'),
        (12, 'ATS'), (13, 'オゼッラ'), (14, 'フィッティパルディ'),
        (0, 'マーチ(1981)'), (0, 'エンサイン'), (0, 'トールマン'), (0, 'セオドール')
    ]),
    (1983, [
        (1, 'フェラーリ'), (2, 'ルノー(1977)'), (3, 'ブラバム'), (4, 'ウィリアムズ'),
        (5, 'マクラーレン'), (6, 'アルファロメオ(1979)'), (7, 'ティレル'),
        (8, 'ロータス(1958)'), (9, 'トールマン'), (10, 'アロウズ(1978)'),
        (12, 'セオドール'), (0, 'リジェ'), (0, 'スピリット'), (0, 'ATS'),
        (0, 'オゼッラ'), (0, 'RAM')
    ]),
    (1984, [
        (1, 'マクラーレン'), (2, 'フェラーリ'), (3, 'ロータス(1958)'),
        (4, 'ブラバム'), (5, 'ルノー(1977)'), (6, 'ウィリアムズ'),
        (7, 'トールマン'), (8, 'アルファロメオ(1979)'), (9, 'リジェ'),
        (10, 'アロウズ(1978)'), (12, 'オゼッラ'), (0, 'ATS'), (0, 'スピリット'),
        (0, 'RAM'), (0, 'ティレル')
    ]),
    (1985, [
        (1, 'マクラーレン'), (2, 'フェラーリ'), (3, 'ウィリアムズ'),
        (4, 'ロータス(1958)'), (5, 'ブラバム'), (6, 'リジェ'),
        (7, 'ルノー(1977)'), (8, 'アロウズ(1978)'), (9, 'ティレル'),
        (0, 'オゼッラ'), (0, 'ミナルディ'), (0, 'アルファロメオ(1979)'), (0, 'RAM'),
        (0, 'ザクスピード'), (0, 'トールマン'), (0, 'スピリット'), (0, 'ローラ(1985)')
    ]),
    (1986, [
        (1, 'ウィリアムズ'), (2, 'マクラーレン'), (3, 'ロータス(1958)'),
        (4, 'フェラーリ'), (5, 'リジェ'), (6, 'ベネトン'), (7, 'ティレル'),
        (8, 'ローラ(1985)'), (9, 'ブラバム'), (10, 'アロウズ(1978)'),
        (0, 'ザクスピード'), (0, 'ミナルディ'), (0, 'オゼッラ'), (0, 'AGS')
    ]),
    (1987, [
        (1, 'ウィリアムズ'), (2, 'マクラーレン'), (3, 'ロータス(1958)'),
        (4, 'フェラーリ'), (5, 'ベネトン'), (6, 'ティレル'), (7, 'アロウズ(1978)'),
        (8, 'ブラバム'), (9, 'ローラ(1987)'), (10, 'ザクスピード'), (11, 'リジェ'),
        (12, 'AGS'), (13, 'マーチ(1987)'), (0, 'ミナルディ'), (0, 'オゼッラ'),
        (0, 'コローニ')
    ]),
    (1988, [
        (1, 'マクラーレン'), (2, 'フェラーリ'), (3, 'ベネトン'),
        (4, 'ロータス(1958)'), (5, 'アロウズ(1978)'), (6, 'マーチ(1987)'),
        (7, 'ウィリアムズ'), (8, 'ティレル'), (9, 'リアル'), (10, 'ミナルディ'),
        (0, 'ローラ(1987)'), (0, 'ダラーラ'), (0, 'AGS'), (0, 'コローニ'),
        (0, 'リジェ'), (0, 'オゼッラ'), (0, 'ユーロブルン'), (0, 'ザクスピード')
    ]),
    (1989, [
        (1, 'マクラーレン'), (2, 'ウィリアムズ'), (3, 'フェラーリ'), (4, 'ベネトン'),
        (5, 'ティレル'), (6, 'ロータス(1958)'), (7, 'アロウズ(1978)'),
        (8, 'ダラーラ'), (9, 'ブラバム'), (10, 'オニクス'), (11, 'ミナルディ'),
        (12, 'マーチ(1987)'), (13, 'リアル'), (14, 'リジェ'), (15, 'AGS'),
        (16, 'ローラ(1987)'), (0, 'オゼッラ'), (0, 'コローニ'), (0, 'ザクスピード'),
        (0, 'ユーロブルン')
    ]),
    (1990, [
        (1, 'マクラーレン'), (2, 'フェラーリ'), (3, 'ベネトン'), (4, 'ウィリアムズ'),
        (5, 'ティレル'), (6, 'ローラ(1987)'), (7, 'レイトンハウス'),
        (8, 'ロータス(1958)'), (9, 'アロウズ(1978)'), (10, 'ブラバム'),
        (0, 'リジェ'), (0, 'ミナルディ'), (0, 'オニクス'), (0, 'AGS'),
        (0, 'ダラーラ'), (0, 'オゼッラ'), (0, 'ユーロブルン'), (0, 'コローニ'),
        (0, 'ライフ')
    ]),
    (1991, [
        (1, 'マクラーレン'), (2, 'ウィリアムズ'), (3, 'フェラーリ'), (4, 'ベネトン'),
        (5, 'ジョーダン'), (6, 'ティレル'), (7, 'ミナルディ'), (8, 'ダラーラ'),
        (9, 'ロータス(1958)'), (10, 'ブラバム'), (11, 'ローラ(1987)'),
        (12, 'レイトンハウス'), (0, 'リジェ'), (0, 'ランボ'), (0, 'AGS'),
        (0, 'フォンドメタル'), (0, 'フットワーク'), (0, 'コローニ')
    ]),
    (1992, [
        (1, 'ウィリアムズ'), (2, 'マクラーレン'), (3, 'ベネトン'), (4, 'フェラーリ'),
        (5, 'ロータス(1958)'), (6, 'ティレル'), (7, 'フットワーク'), (8, 'リジェ'),
        (9, 'マーチ(1992)'), (10, 'ダラーラ'), (11, 'ジョーダン'), (12, 'ミナルディ'),
        (13, 'ヴェンチュリー'), (14, 'フォンドメタル'), (15, 'ブラバム'),
        (0, 'アンドレア・モーダ')
    ]),
    (1993, [
        (1, 'ウィリアムズ'), (2, 'マクラーレン'), (3, 'ベネトン'), (4, 'フェラーリ'),
        (5, 'リジェ'), (6, 'ロータス(1958)'), (7, 'ザウバー(1993)'), (8, 'ミナルディ'),
        (9, 'フットワーク'), (10, 'ラルース'), (11, 'ジョーダン'), (0, 'ティレル'),
        (0, 'ローラ(1993)')
    ]),
    (1994, [
        (1, 'ウィリアムズ'), (2, 'ベネトン'), (3, 'フェラーリ'), (4, 'マクラーレン'),
        (5, 'ジョーダン'), (6, 'リジェ'), (7, 'ティレル'), (8, 'ザウバー(1993)'),
        (9, 'フットワーク'), (10, 'ミナルディ'), (11, 'ラルース'),
        (0, 'ロータス(1958)'), (0, 'シムテック'), (0, 'パシフィック')
    ]),
    (1995, [
        (1, 'ベネトン'), (2, 'ウィリアムズ'), (3, 'フェラーリ'), (4, 'マクラーレン'),
        (5, 'リジェ'), (6, 'ジョーダン'), (7, 'ザウバー(1993)'), (8, 'フットワーク'),
        (9, 'ティレル'), (10, 'ミナルディ'), (0, 'フォルティ'), (0, 'パシフィック'),
        (0, 'シムテック')
    ]),
    (1996, [
        (1, 'ウィリアムズ'), (2, 'フェラーリ'), (3, 'ベネトン'), (4, 'マクラーレン'),
        (5, 'ジョーダン'), (6, 'リジェ'), (7, 'ザウバー(1993)'), (8, 'ティレル'),
        (9, 'フットワーク'), (0, 'ミナルディ'), (0, 'フォルティ')
    ]),
    (1997, [
        (1, 'ウィリアムズ'), (2, 'フェラーリ'), (3, 'ベネトン'), (4, 'マクラーレン'),
        (5, 'ジョーダン'), (6, 'プロスト'), (7, 'ザウバー(1993)'), (8, 'アロウズ(1997)'),
        (9, 'スチュワート'), (10, 'ティレル'), (0, 'ミナルディ'), (0, 'ローラ(1997)')
    ]),
    (1998, [
        (1, 'マクラーレン'), (2, 'フェラーリ'), (3, 'ウィリアムズ'), (4, 'ジョーダン'),
        (5, 'ベネトン'), (6, 'ザウバー(1993)'), (7, 'アロウズ(1997)'), (8, 'スチュワート'),
        (9, 'プロスト'), (10, 'ミナルディ'), (11, 'ティレル')
    ]),
    (1999, [
        (1, 'フェラーリ'), (2, 'マクラーレン'), (3, 'ジョーダン'), (4, 'スチュワート'),
        (5, 'ウィリアムズ'), (6, 'ベネトン'), (7, 'プロスト'), (8, 'ザウバー(1993)'),
        (9, 'アロウズ(1997)'), (10, 'ミナルディ'), (11, 'BAR')
    ]),
    (2000, [
        (1, 'フェラーリ'), (2, 'マクラーレン'), (3, 'ウィリアムズ'), (4, 'ベネトン'),
        (5, 'BAR'), (6, 'ジョーダン'), (7, 'アロウズ(1997)'), (8, 'ザウバー(1993)'),
        (9, 'ジャガー'), (10, 'ミナルディ'), (11, 'プロスト')
    ]),
    (2001, [
        (1, 'フェラーリ'), (2, 'マクラーレン'), (3, 'ウィリアムズ'), (4, 'ザウバー(1993)'),
        (5, 'ジョーダン'), (6, 'BAR'), (7, 'ベネトン'), (8, 'ジャガー'),
        (9, 'プロスト'), (10, 'アロウズ(1997)'), (11, 'ミナルディ')
    ]),
    (2002, [
        (1, 'フェラーリ'), (2, 'ウィリアムズ'), (3, 'マクラーレン'),
        (4, 'ルノー(2002)'), (5, 'ザウバー(1993)'), (6, 'ジョーダン'), (7, 'ジャガー'),
        (8, 'BAR'), (9, 'ミナルディ'), (10, 'トヨタ'), (11, 'アロウズ(1997)')
    ]),
    (2003, [
        (1, 'フェラーリ'), (2, 'ウィリアムズ'), (3, 'マクラーレン'),
        (4, 'ルノー(2002)'), (5, 'BAR'), (6, 'ザウバー(1993)'), (7, 'ジャガー'),
        (8, 'トヨタ'), (9, 'ジョーダン'), (10, 'ミナルディ')
    ]),
    (2004, [
        (1, 'フェラーリ'), (2, 'BAR'), (3, 'ルノー(2002)'), (4, 'ウィリアムズ'),
        (5, 'マクラーレン'), (6, 'ザウバー(1993)'), (7, 'ジャガー'), (8, 'トヨタ'),
        (9, 'ジョーダン'), (10, 'ミナルディ')
    ]),
    (2005, [
        (1, 'ルノー(2002)'), (2, 'マクラーレン'), (3, 'フェラーリ'), (4, 'トヨタ'),
        (5, 'ウィリアムズ'), (6, 'BAR'), (7, 'レッドブル'), (8, 'ザウバー(1993)'),
        (9, 'ジョーダン'), (10, 'ミナルディ')
    ]),
    (2006, [
        (1, 'ルノー(2002)'), (2, 'フェラーリ'), (3, 'マクラーレン'),
        (4, 'ホンダ(2006)'), (5, 'BMWザウバー'), (6, 'トヨタ'), (7, 'レッドブル'),
        (8, 'ウィリアムズ'), (9, 'トロ・ロッソ'), (10, 'MF1'), (11, 'スーパーアグリ')
    ]),
    (2007, [
        (1, 'フェラーリ'), (2, 'BMWザウバー'), (3, 'ルノー(2002)'), (4, 'ウィリアムズ'),
        (5, 'レッドブル'), (6, 'トヨタ'), (7, 'トロ・ロッソ'), (8, 'ホンダ(2006)'),
        (9, 'スーパーアグリ'), (10, 'スパイカー'), (0, 'マクラーレン')
    ]),
    (2008, [
        (1, 'フェラーリ'), (2, 'マクラーレン'), (3, 'BMWザウバー'), (4, 'ルノー(2002)'),
        (5, 'トヨタ'), (6, 'トロ・ロッソ'), (7, 'レッドブル'), (8, 'ウィリアムズ'),
        (9, 'ホンダ(2006)'), (10, 'フォース・インディア'), (11, 'スーパーアグリ')
    ]),
    (2009, [
        (1, 'ブラウン'), (2, 'レッドブル'), (3, 'マクラーレン'), (4, 'フェラーリ'),
        (5, 'トヨタ'), (6, 'BMWザウバー'), (7, 'ウィリアムズ'), (8, 'ルノー(2002)'),
        (9, 'フォース・インディア'), (10, 'トロ・ロッソ')
    ]),
    (2010, [
        (1, 'レッドブル'), (2, 'マクラーレン'), (3, 'フェラーリ'),
        (4, 'メルセデス(2010)'), (5, 'ルノー(2002)'), (6, 'ウィリアムズ'),
        (7, 'フォース・インディア'), (8, 'ザウバー(2010)'), (9, 'トロ・ロッソ'),
        (10, 'ロータス(2010)'), (11, 'HRT'), (12, 'ヴァージン')
    ]),
    (2011, [
        (1, 'レッドブル'), (2, 'マクラーレン'), (3, 'フェラーリ'),
        (4, 'メルセデス(2010)'), (5, 'ルノー(2002)'), (6, 'フォース・インディア'),
        (7, 'ザウバー(2010)'), (8, 'トロ・ロッソ'), (9, 'ウィリアムズ'),
        (10, 'ロータス(2010)'), (11, 'HRT'), (12, 'ヴァージン')
    ]),
    (2012, [
        (1, 'レッドブル'), (2, 'フェラーリ'), (3, 'マクラーレン'),
        (4, 'ロータス(2012)'), (5, 'メルセデス(2010)'), (6, 'ザウバー(2010)'),
        (7, 'フォース・インディア'), (8, 'ウィリアムズ'), (9, 'トロ・ロッソ'),
        (10, 'ケータハム'), (11, 'マルシャ'), (12, 'HRT')
    ]),
    (2013, [
        (1, 'レッドブル'), (2, 'メルセデス(2010)'), (3, 'フェラーリ'),
        (4, 'ロータス(2012)'), (5, 'マクラーレン'), (6, 'フォース・インディア'),
        (7, 'ザウバー(2010)'), (8, 'トロ・ロッソ'), (9, 'ウィリアムズ'),
        (10, 'マルシャ'), (11, 'ケータハム')
    ]),
    (2014, [
        (1, 'メルセデス(2010)'), (2, 'レッドブル'), (3, 'ウィリアムズ'),
        (4, 'フェラーリ'), (5, 'マクラーレン'), (6, 'フォース・インディア'),
        (7, 'トロ・ロッソ'), (8, 'ロータス(2012)'), (9, 'マルシャ'),
        (10, 'ザウバー(2010)'), (11, 'ケータハム')
    ]),
    (2015, [
        (1, 'メルセデス(2010)'), (2, 'フェラーリ'), (3, 'ウィリアムズ'),
        (4, 'レッドブル'), (5, 'フォース・インディア'), (6, 'ロータス(2012)'),
        (7, 'トロ・ロッソ'), (8, 'ザウバー(2010)'), (9, 'マクラーレン'),
        (10, 'マルシャ')
    ]),
    (2016, [
        (1, 'メルセデス(2010)'), (2, 'レッドブル'), (3, 'フェラーリ'),
        (4, 'フォース・インディア'), (5, 'ウィリアムズ'), (6, 'マクラーレン'),
        (7, 'トロ・ロッソ'), (8, 'ハース'), (9, 'ルノー(2016)'),
        (10, 'ザウバー(2010)'), (11, 'MRT')
    ]),
    (2017, [
        (1, 'メルセデス(2010)'), (2, 'フェラーリ'), (3, 'レッドブル'),
        (4, 'フォース・インディア'), (5, 'ウィリアムズ'), (9, 'ルノー(2016)'),
        (7, 'トロ・ロッソ'), (8, 'ハース'), (9, 'マクラーレン'),
        (10, 'ザウバー(2010)')
    ])
]

constructor_connect = [
    (('シャドウ', 1980), ('セオドール', 1981)),
    (('マーチ(1981)', 1982), ('RAM', 1983)),
    (('エンサイン', 1982), ('セオドール', 1983)),
    (('トールマン', 1985), ('ベネトン', 1986)),
    (('マーチ(1987)', 1989), ('レイトンハウス', 1990)),
    (('アロウズ(1978)', 1990), ('フットワーク', 1991)),
    (('オゼッラ', 1990), ('フォンドメタル', 1991)),
    (('レイトンハウス', 1991), ('マーチ(1992)', 1992)),
    (('ローラ(1987)', 1991), ('ヴェンチュリー', 1992)),
    (('コローニ', 1991), ('アンドレア・モーダ', 1992)),
    (('ヴェンチュリー', 1992), ('ラルース', 1993)),
    (('ダラーラ', 1992), ('ローラ(1993)', 1993)),
    (('ローラ(1993)', 1993), ('ミナルディ', 1994)),
    (('リジェ', 1996), ('プロスト', 1997)),
    (('フットワーク', 1996), ('アロウズ(1997)', 1997)),
    (('ティレル', 1998), ('BAR', 1999)),
    (('スチュワート', 1999), ('ジャガー', 2000)),
    (('ベネトン', 2001), ('ルノー(2002)', 2002)),
    (('ジャガー', 2004), ('レッドブル', 2005)),
    (('ザウバー(1993)', 2005), ('BMWザウバー', 2006)),
    (('ミナルディ', 2005), ('トロ・ロッソ', 2006)),
    (('ジョーダン', 2005), ('MF1', 2006)),
    (('BAR', 2005), ('ホンダ(2006)', 2006)),
    (('MF1', 2006), ('スパイカー', 2007)),
    (('スパイカー', 2007), ('フォース・インディア', 2008)),
    (('ホンダ(2006)', 2008), ('ブラウン', 2009)),
    (('ブラウン', 2009), ('メルセデス(2010)', 2010)),
    (('BMWザウバー', 2009), ('ザウバー(2010)', 2010)),
    (('ルノー(2002)', 2011), ('ロータス(2012)', 2012)),
    (('ロータス(2010)', 2011), ('ケータハム', 2012)),
    (('ヴァージン', 2011), ('マルシャ', 2012)),
    (('ロータス(2012)', 2015), ('ルノー(2016)', 2016)),
    (('マルシャ', 2015), ('MRT', 2016))
]
